In [10]:
import numpy as np
import pandas as pd 
np.random.seed(12345)
import matplotlib.pyplot as plt
plt.rc("figure", figsize=(10, 6))
pd.options.display.max_colwidth = 75
pd.options.display.max_columns = 20
np.set_printoptions(precision=4, suppress=True)

In [2]:
!cat /Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex1.csv

a,b,c,d,message
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [3]:
df = pd.read_csv("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex1.csv")

In [4]:
df

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [5]:
!cat /Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex2.csv

1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [6]:
pd.read_csv("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex2.csv", header=None)

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [7]:
pd.read_csv("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex2.csv",
            names=["a", "b", "c", "d", "message"])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [8]:
names = ["a", "b", "c", "d", "message"]
pd.read_csv("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex2.csv",
            names=names, index_col="message")

         a   b   c   d
message
hello    1   2   3   4
world    5   6   7   8
foo      9  10  11  12

In [9]:
!cat /Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/csv_mindex.csv

key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

In [10]:
parsed = pd.read_csv("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/csv_mindex.csv",
                     index_col=["key1", "key2"])

In [11]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

In [12]:
!cat /Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex3.txt

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [13]:
result = pd.read_csv("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex3.txt",
                    sep="\s+")

In [14]:
result

            A         B         C
aaa -0.264438 -1.026059 -0.619500
bbb  0.927272  0.302904 -0.032399
ccc -0.264273 -0.386314 -0.217601
ddd -0.871858 -0.348382  1.100491

In [15]:
!cat /Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex4.csv

# hey!
a,b,c,d,message
# just wanted to make things more difficult for you
# who reads CSV files with computers, anyway?
1,2,3,4,hello
5,6,7,8,world
9,10,11,12,foo

In [16]:
pd.read_csv("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex4.csv", 
            skiprows=[0, 2, 3])

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [17]:
!cat /Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex5.csv

something,a,b,c,d,message
one,1,2,3,4,NA
two,5,6,,8,world
three,9,10,11,12,foo

In [18]:
result = pd.read_csv("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex5.csv")

In [19]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [20]:
pd.isna(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False   True  False    False
2      False  False  False  False  False    False

In [21]:
result = pd.read_csv("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex5.csv", na_values=["NULL"])

In [22]:
result

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [23]:
result2 = pd.read_csv("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex5.csv", 
                      keep_default_na=False)

In [24]:
result2

  something  a   b   c   d message
0       one  1   2   3   4      NA
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [25]:
result2.isna()

   something      a      b      c      d  message
0      False  False  False  False  False    False
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [26]:
result3 = pd.read_csv("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex5.csv", 
                      keep_default_na=False, na_values=["NA"])

In [27]:
result3

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [28]:
result3.isna()

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False    False

In [29]:
sentinels = {"message": ["foo", "NA"], "something": ["two"]}
pd.read_csv("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex5.csv", 
            na_values=sentinels, keep_default_na=False)

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       NaN  5   6       8   world
2     three  9  10  11  12     NaN

In [30]:
pd.options.display.max_rows = 10

In [31]:
result = pd.read_csv("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex6.csv")

In [32]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

In [33]:
pd.read_csv("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex6.csv", 
            nrows=5)

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

In [34]:
chunker = pd.read_csv("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex6.csv",
                      chunksize=1000)

In [35]:
type(chunker)

pandas.io.parsers.readers.TextFileReader

In [36]:
chunker = pd.read_csv("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex6.csv", 
                      chunksize=1000)

tot = pd.Series([], dtype='int64')
for piece in chunker:
    tot = tot.add(piece["key"].value_counts(), fill_value=0)
    
tot = tot.sort_values(ascending=False)

In [37]:
tot[:10]

key
E    368.0
X    364.0
L    346.0
O    343.0
Q    340.0
M    338.0
J    337.0
F    335.0
K    334.0
H    330.0
dtype: float64

In [38]:
data = pd.read_csv("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex5.csv")

In [39]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [40]:
data.to_csv("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/out.csv")

In [41]:
!cat /Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/out.csv

,something,a,b,c,d,message
0,one,1,2,3.0,4,
1,two,5,6,,8,world
2,three,9,10,11.0,12,foo

In [42]:
import sys

In [43]:
data.to_csv(sys.stdout, sep="|")

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

In [44]:
data.to_csv(sys.stdout, na_rep="NULL")

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

In [45]:
data.to_csv(sys.stdout, index=False, header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

In [46]:
data.to_csv(sys.stdout, index=False, columns=["a", "b", "c"])

a,b,c
1,2,3.0
5,6,
9,10,11.0

In [47]:
!cat /Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex7.csv

"a","b","c"
"1","2","3"
"1","2","3"

In [48]:
import csv

In [49]:
f = open("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex7.csv")

In [50]:
reader = csv.reader(f)

In [51]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [52]:
f.close()

In [53]:
with open("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex7.csv") as f:
    lines =list(csv.reader(f))

In [54]:
header, values = lines[0], lines[1:]

In [55]:
data_dict = {h: v for h, v in zip(header, zip(*values))}

In [56]:
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

In [57]:
class my_dialect(csv.Dialect):
    lineterminator = "\n"
    delimiter = ";"
    quotechar = '"'
    quoting = csv.QUOTE_MINIMAL

reader = csv.reader(f, dialect=my_dialect)

ValueError: I/O operation on closed file.

In [58]:
reader = csv.reader(f, delimiter= "|")

ValueError: I/O operation on closed file.

In [59]:
with open("mydata.csv", "w") as f:
    writer = csv.writer(f, dialect=my_dialect)
    writer.writerow(("one", "two", "three"))
    writer.writerow(("1", "2", "3"))
    writer.writerow(("4", "5", "6"))
    writer.writerow(("7", "8", "9"))

In [60]:
obj = """
{"name": "Wes",
 "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, 
              {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]

}
"""

In [61]:
import json

In [62]:
result = json.loads(obj)

In [63]:
result

{'name': 'Wes',
 'cities_lived': ['Akron', 'Nashville', 'New York', 'San Francisco'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 34, 'hobbies': ['guitars', 'soccer']},
  {'name': 'Katie', 'age': 42, 'hobbies': ['diving', 'art']}]}

In [64]:
asjson = json.dumps(result)

In [65]:
asjson

'{"name": "Wes", "cities_lived": ["Akron", "Nashville", "New York", "San Francisco"], "pet": null, "siblings": [{"name": "Scott", "age": 34, "hobbies": ["guitars", "soccer"]}, {"name": "Katie", "age": 42, "hobbies": ["diving", "art"]}]}'

In [66]:
siblings = pd.DataFrame(result["siblings"], columns=["name", "age"])

In [67]:
siblings

    name  age
0  Scott   34
1  Katie   42

In [68]:
!cat /Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/example.json

[{"a": 1, "b": 2, "c": 3},
 {"a": 4, "b": 5, "c": 6},
 {"a": 7, "b": 8, "c": 9}]

In [69]:
data = pd.read_json("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/example.json")

In [70]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [71]:
data.to_json(sys.stdout)

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [72]:
data.to_json(sys.stdout, orient="records")

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [73]:
pip install lxml beautifulsoup4 html5lib

Requirement already satisfied: lxml in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (5.2.2)
Requirement already satisfied: beautifulsoup4 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (4.12.2)
Requirement already satisfied: html5lib in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (1.1)
Requirement already satisfied: soupsieve>1.2 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from beautifulsoup4) (2.4.1)
Requirement already satisfied: six>=1.9 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from html5lib) (1.16.0)
Requirement already satisfied: webencodings in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from html5lib) (0.5.1)

[notice] A new release of pip is available: 24.0 -> 24.1.2
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [74]:
tables = pd.read_html("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/fdic_failed_bank_list.html")

In [75]:
len(tables)

1

In [76]:
failures = tables[0]

In [77]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [78]:
close_timestamps = pd.to_datetime(failures["Closing Date"])

In [79]:
close_timestamps.dt.year.value_counts()

Closing Date
2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: count, Length: 15, dtype: int64

In [80]:
from lxml import objectify

In [81]:
path = "/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/datasets/mta_perf/Performance_MNR.xml"

In [82]:
with open(path) as f:
    parsed = objectify.parse(f)
    
root = parsed.getroot()

In [83]:
data = []

skip_fields = ["PARENT_SEQ", "INDICATOR_SEQ", "DESIRED_CHANGE", "DECIMAL_PLACES"]

for elt in root.INDICATOR:
    el_data = {}
    for child in elt.getchildren():
        if child.tag in skip_fields:
            continue
        el_data[child.tag] = child.pyval
    data.append(el_data)

In [84]:
perf = pd.DataFrame(data)

In [85]:
perf.head()

,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,INDICATOR_UNIT,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at their destinations within 5 m...,2008,1,Service Indicators,M,%,95.0,96.9,95.0,96.9
1,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at their destinations within 5 m...,2008,2,Service Indicators,M,%,95.0,96.0,95.0,95.0
2,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at their destinations within 5 m...,2008,3,Service Indicators,M,%,95.0,96.3,95.0,96.9
3,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at their destinations within 5 m...,2008,4,Service Indicators,M,%,95.0,96.8,95.0,98.3
4,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at their destinations within 5 m...,2008,5,Service Indicators,M,%,95.0,96.6,95.0,95.8

In [86]:
perf2 = pd.read_xml(path)

In [87]:
perf2.head()

,INDICATOR_SEQ,PARENT_SEQ,AGENCY_NAME,INDICATOR_NAME,DESCRIPTION,PERIOD_YEAR,PERIOD_MONTH,CATEGORY,FREQUENCY,DESIRED_CHANGE,INDICATOR_UNIT,DECIMAL_PLACES,YTD_TARGET,YTD_ACTUAL,MONTHLY_TARGET,MONTHLY_ACTUAL
0,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at their destinations within 5 m...,2008,1,Service Indicators,M,U,%,1,95.00,96.90,95.00,96.90
1,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at their destinations within 5 m...,2008,2,Service Indicators,M,U,%,1,95.00,96.00,95.00,95.00
2,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at their destinations within 5 m...,2008,3,Service Indicators,M,U,%,1,95.00,96.30,95.00,96.90
3,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at their destinations within 5 m...,2008,4,Service Indicators,M,U,%,1,95.00,96.80,95.00,98.30
4,28445,NaN,Metro-North Railroad,On-Time Performance (West of Hudson),Percent of commuter trains that arrive at their destinations within 5 m...,2008,5,Service Indicators,M,U,%,1,95.00,96.60,95.00,95.80

In [88]:
frame = pd.read_csv("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex1.csv")

In [89]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [90]:
frame.to_pickle("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/frame_pickle")

In [91]:
pd.read_pickle("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/frame_pickle")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [92]:
fec = pd.read_parquet("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/datasets/fec/fec.parquet")

In [93]:
pip install openpyxl xlrd

Requirement already satisfied: openpyxl in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (3.1.5)
Requirement already satisfied: xlrd in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (2.0.1)
Requirement already satisfied: et-xmlfile in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from openpyxl) (1.1.0)

[notice] A new release of pip is available: 24.0 -> 24.1.2
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [94]:
xlsx = pd.ExcelFile("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex1.xlsx")

In [95]:
xlsx.sheet_names

['Sheet1']

In [96]:
xlsx.parse(sheet_name="Sheet1")

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [97]:
xlsx.parse(sheet_name="Sheet1", index_col=0)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [98]:
frame = pd.read_excel("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex1.xlsx", sheet_name="Sheet1")

In [99]:
frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [100]:
writer = pd.ExcelWriter("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex2.xlsx")

In [101]:
frame.to_excel(writer, "Sheet1")

/var/folders/09/kwh57pm92_gfzd297vb_r36c0000gn/T/ipykernel_30759/2112036528.py:1: FutureWarning: Starting with pandas version 3.0 all arguments of to_excel except for the argument 'excel_writer' will be keyword-only.
  frame.to_excel(writer, "Sheet1")

In [102]:
writer.save()

AttributeError: 'OpenpyxlWriter' object has no attribute 'save'

In [104]:
frame.to_excel("/Users/ray/Documents/machine_learning_engineer/pydata-book-ch-ex/pydata-book/examples/ex2.xlsx")

In [1]:
pip install requests

Collecting requests
  Downloading requests-2.32.3-py3-none-any.whl.metadata (4.6 kB)
Collecting charset-normalizer<4,>=2 (from requests)
  Downloading charset_normalizer-3.3.2-cp311-cp311-macosx_11_0_arm64.whl.metadata (33 kB)
Requirement already satisfied: idna<4,>=2.5 in /Library/Frameworks/Python.framework/Versions/3.11/lib/python3.11/site-packages (from requests) (3.4)
Collecting urllib3<3,>=1.21.1 (from requests)
  Downloading urllib3-2.2.2-py3-none-any.whl.metadata (6.4 kB)
Collecting certifi>=2017.4.17 (from requests)
  Downloading certifi-2024.7.4-py3-none-any.whl.metadata (2.2 kB)
Downloading requests-2.32.3-py3-none-any.whl (64 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 64.9/64.9 kB 2.1 MB/s eta 0:00:00
Downloading certifi-2024.7.4-py3-none-any.whl (162 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 163.0/163.0 kB 3.7 MB/s eta 0:00:00[31m4.4 MB/s eta 0:00:01
Downloading charset_normalizer-3.3.2-cp311-cp311-macosx_11_0_arm64.whl (118 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 119.0/119.0 kB 7.9 MB/s eta 0:00:00
Downloading urllib3-2.2.2-py3-none-any.whl (121 kB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 121.4/121.4 kB 9.3 MB/s eta 0:00:00
Installing collected packages: urllib3, charset-normalizer, certifi, requests
Successfully installed certifi-2024.7.4 charset-normalizer-3.3.2 requests-2.32.3 urllib3-2.2.2

[notice] A new release of pip is available: 24.0 -> 24.1.2
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [2]:
import requests

In [3]:
url = "https://api.github.com/repos/pandas-dev/pandas/issues"

In [4]:
resp = requests.get(url)

In [5]:
resp.raise_for_status()

In [6]:
resp

In [7]:
data = resp.json()

In [8]:
data[0]["title"]

'ENH: Support right hand side operations with Series and custom classes'

In [11]:
issues = pd.DataFrame(data, columns=["number", "title", "labels", "state"])

In [12]:
issues

,number,title,labels,state
0,59263,ENH: Support right hand side operations with Series and custom classes,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg==', 'url': 'https://api.g...",open
1,59262,Removed SA01 error for pandas.Series.to_frame. Added See Also section…,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OTk=', 'url': 'https://api....",open
2,59261,BUG: Series.mul silently returns wrong values with `UInt8` dtype when o...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ==', 'url': 'https://api.g...",open
3,59260,BUILD:,"[{'id': 129350, 'node_id': 'MDU6TGFiZWwxMjkzNTA=', 'url': 'https://api....",open
4,59258,BUG: pandas-dev#58594,[],open
5,59257,DEPS: Bump misc testing dependencies,"[{'id': 127685, 'node_id': 'MDU6TGFiZWwxMjc2ODU=', 'url': 'https://api....",open
6,59256,BUG: Wrong timestamp resolution when parsing timestamp string with comm...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ==', 'url': 'https://api.g...",open
7,59252,"BUG: rolling window with `center=True, min_periods=1` is not symmetric ...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ==', 'url': 'https://api.g...",open
8,59249,"BUG: Pandas squashes 1-dimensional Numpy array with shape (1,) down to ...","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ==', 'url': 'https://api.g...",open
9,59242,BUG: read_sql tries to convert blob/varbinary to string with pyarrow ba...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ==', 'url': 'https://api.g...",open
10,59241,"ENH: pd.cut() supports str for ""bin"" argument",[],open
11,59240,WIP clean: simplify lite-rule-alias and dont-uppercase,[],open
12,59239,ENH: DataFrame.plot.scatter argument `c` now accepts a column of string...,[],open
13,59238,Add column_offset to explode,[],open
14,59237,ENH: Reduce type requirements for the subset parameter in drop_duplicat...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg==', 'url': 'https://api.g...",open
15,59235,ENH: Consistent API between `pd.get_dummies()` and `Series.str.get_dumm...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg==', 'url': 'https://api.g...",open
16,59233,BUG: json_normalize KeyError Key not found,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ==', 'url': 'https://api.g...",open
17,59231,"DOC: sentence fragment in ""String methods""",[],open
18,59228,CLN: enforce the deprecation ofaccepting Manager objects in DataFrame/S...,[],open
19,59227,BUG: AttributeError about dateutil.relativedelta when calling pd.read_j...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ==', 'url': 'https://api.g...",open
20,59225,BUG: fix json_normalize with meta far different from record_path,[],open
21,59224,BUG: SQL connection,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ==', 'url': 'https://api.g...",open
22,59222,"BUG: unexpected behavior when Loading lines like ""\""""\t""a""","[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ==', 'url': 'https://api.g...",open
23,59221,ENH: Replacing behavior currently provided by pandas.to_numeric using e...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg==', 'url': 'https://api.g...",open
24,59219,BUG: Fix read_csv index dtype override,[],open
25,59217,fix-issue-59196: add extra check for np arrays,[],open
26,59216,DOC: add SA01 for pandas.api.types.is_int64_dtype,[],open
27,59215,DOC: add SA01 for pandas.api.types.is_extension_array_dtype,[],open
28,59212,BUG: regression in master for DataFrame.sparse.from_spmatrix,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ==', 'url': 'https://api.g...",open
29,59207,"ENH: Extend to_numeric to Convert Hexadecimal, Octal, and Binary String...","[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg==', 'url': 'https://api.g...",open

In [13]:
import sqlite3

In [15]:
query = """
CREATE TABLE test
(a VARCHAR(20), b VARCHAR(20), c REAL, d INTEGER
);

"""

In [16]:
con = sqlite3.connect("mydata.sqlite")

In [17]:
con.execute(query)

In [18]:
con.commit()

In [19]:
data = [("Atlanta", "Georgia", 1.25, 6),
        ("Tallahassee", "Florida", 2.6, 3),
        ("Sacramento", "California", 1.7, 5)]

In [20]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [21]:
con.executemany(stmt, data)

In [23]:
con.commit()

In [24]:
cursor = con.execute("SELECT * FROM test")

In [25]:
rows = cursor.fetchall()

In [26]:
rows

[('Atlanta', 'Georgia', 1.25, 6),
 ('Tallahassee', 'Florida', 2.6, 3),
 ('Sacramento', 'California', 1.7, 5)]

In [27]:
cursor.description

(('a', None, None, None, None, None, None),
 ('b', None, None, None, None, None, None),
 ('c', None, None, None, None, None, None),
 ('d', None, None, None, None, None, None))

In [28]:
pd.DataFrame(rows, columns=[x[0] for x in cursor.description])

             a           b     c  d
0      Atlanta     Georgia  1.25  6
1  Tallahassee     Florida  2.60  3
2   Sacramento  California  1.70  5

In [29]:
pip install sqlalchemy

Collecting sqlalchemy
  Downloading SQLAlchemy-2.0.31-cp311-cp311-macosx_11_0_arm64.whl.metadata (9.6 kB)
Collecting typing-extensions>=4.6.0 (from sqlalchemy)
  Downloading typing_extensions-4.12.2-py3-none-any.whl.metadata (3.0 kB)
Downloading SQLAlchemy-2.0.31-cp311-cp311-macosx_11_0_arm64.whl (2.1 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2.1/2.1 MB 5.0 MB/s eta 0:00:00 MB/s eta 0:00:01:01
Downloading typing_extensions-4.12.2-py3-none-any.whl (37 kB)
Installing collected packages: typing-extensions, sqlalchemy
Successfully installed sqlalchemy-2.0.31 typing-extensions-4.12.2

[notice] A new release of pip is available: 24.0 -> 24.1.2
[notice] To update, run: pip install --upgrade pip
Note: you may need to restart the kernel to use updated packages.

In [30]:
import sqlalchemy

In [31]:
db = sqla.create_engine("sqlite://mydata.sqlite")

NameError: name 'sqla' is not defined

In [ ]:
p